skandinaff/QREC/PROJECT-01-STM32F429_FFT/User/main.c
/**
 *	Keil project example for FFT on STM32F4 device.
 *
 *	Works on STM32F429-Discovery board because it has LCD
 *
 *	@author		Tilen Majerle
 *	@email		tilen@majerle.eu
 *	@website	http://stm32f4-discovery.com
 *	@ide		Keil uVision 5
 *	@packs		STM32F4xx Keil packs version 2.2.0 or greater required
 *	@stdperiph	STM32F4xx Standard peripheral drivers version 1.4.0 or greater required
 *
 *	Notes: 
 *		- Under "Options for target" > "C/C++" > "Define" you must add 2 defines (I've already add them):
 *			- ARM_MATH_CM4
 *			- __FPU_PRESENT=1
 */
 
// Timers clock is 45 Mhz
// System Clock is 180 Mhz
/* Include core modules */
#include "stm32f4xx.h"
#include "defines.h"
#include "tm_stm32f4_delay.h"
#include "tm_stm32f4_ili9341_ltdc.h"
#include "tm_stm32f4_adc.h"
#include "tm_stm32f4_disco.h"
#include "tm_stm32f4_sdram.h"
#include "tm_stm32f4_dac_signal.h"

#include "tm_stm32f4_button.h"
#include "tm_stm32f4_usart.h"

#include <stdio.h>
#include <string.h>
#include <stdbool.h>

/* Include arm_math.h mathematic functions */
#include "arm_math.h"

/* Includes for timer to work */
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"


typedef struct {
	int packet_length;
	
	char master_stat_byte;
	char slave_address;
	char instruction;
	char player_count;
	char hint_count;
	char crc8;
	char stop_byte;
} incoming_packet_t;


typedef struct {
	char slave_start_byte;
	char slave_address;
	char instruction;
	char crc8;
	char stop_byte;
} outgoing_packet_t;



/* FFT settings */
#define SAMPLES					    512 			/* 256 real party and 256 imaginary parts */
#define FFT_SIZE				    SAMPLES / 2		/* FFT size is always the same size as we have samples, so 256 in our case */

#define FFT_BAR_MAX_HEIGHT		    120 		    /* 120 px on the LCD */

#define QUEST_ID					0x10
#define DATA_PACKET_LEN		        7
#define OUTGOING_PACKET_LENGTH      5
#define MASTER_START_BYTE	        0xC1
#define SLAVE_START_BYTE	        0xC2
#define STOP_BYTE					0xC0
#define RESTRICTED_BYTE             0x7B

//------------- 
#define INSTR_MASTER_TEST			0x01
#define INSTR_MASTER_WORK_START		0x02			
#define INSTR_MASTER_STATUS_REQ		0x03			
#define INSTR_MASTER_SET_IDLE		0x04

//------------- 
#define INSTR_SLAVE_NOT_READY		0x01
#define INSTR_SLAVE_READY			0x02
#define INSTR_SLAVE_NOT_COMLETED	0x03			
#define INSTR_SLAVE_COMPLETED		0x04

GPIO_InitTypeDef GPIO_InintStructure;


TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure;

TIM_TimeBaseInitTypeDef TIM_TimeBaseStructure_TIM5;

TM_BUTTON_t* MyButton;



// Function prototypes

void INTTIM2_Config(void);
void INTTIM5_Config(void);
void readPulse(void);
void BUTTON1_EventHandler(TM_BUTTON_PressType_t type);

/* Global variables */
float32_t Input[SAMPLES];
float32_t Output[FFT_SIZE];

uint16_t secondsCount = 0;
uint16_t tim5_count = 0;
uint16_t tim5_count2 = 0;
uint16_t counter = 0;
uint16_t counter2 = 0;



uint16_t time = 1;

uint32_t pulse = 0;

uint16_t ButtonState = 0;



uint16_t old_tim5_count = 0;

//USART variables

char str[15];
char buffer[15];
uint8_t msg_size;

unsigned char sample[] = {0xC1, 0x10, 0x01, 0xFF, 0xC0};
unsigned char sample2[] = {0xC1, 0x10, 0x01, 0xAA, 0xAA, 0xFF, 0xC0};
unsigned char rx_data[DATA_PACKET_LEN];
unsigned char rx_buff[DATA_PACKET_LEN];

// NEW USART variables

// USART Receiver buffer
#define RX_BUFFER_SIZE 350
volatile uint8_t  rx_buffer[RX_BUFFER_SIZE];
volatile uint16_t rx_wr_index=0,rx_rd_index=0;
volatile uint16_t rx_counter=0;
volatile uint8_t rx_buffer_overflow=0;

// USART Transmitter buffer
#define TX_BUFFER_SIZE 350
volatile uint8_t tx_buffer[TX_BUFFER_SIZE];
volatile uint16_t tx_wr_index=0,tx_rd_index=0;
volatile uint16_t tx_counter=0;


//Pulse Reader variables

volatile uint16_t BPM;
volatile uint16_t Signal;
volatile uint16_t IBI = 600;
volatile uint16_t Pulse = 0;
volatile uint16_t QS = 0;
	
	
volatile uint16_t rate[10];                    // array to hold last ten IBI values
volatile uint32_t sampleCounter = 0;          // used to determine pulse timing
volatile uint32_t lastBeatTime = 0;           // used to find IBI
volatile uint16_t P = 2048; //512;                     // used to find peak in pulse wave, seeded
volatile uint16_t T = 2048; //512;                     // used to find trough in pulse wave, seeded
volatile uint16_t thresh = 2048; //525;                // used to find instant moment of heart beat, seeded
volatile uint16_t amp = 100; //100;                   // used to hold amplitude of pulse waveform, seeded
volatile uint16_t firstBeat = 1;        // used to seed rate array so we startup with reasonable BPM
volatile uint16_t secondBeat = 1;      // used to seed rate array so we startup with reasonable BPM

char adc_result_str[15];
char BPM_result_str[15];
char thresh_restult_str[15];




/* Draw bar for LCD */
/* Simple library to draw bars */
void DrawBar(uint16_t bottomX, uint16_t bottomY, uint16_t maxHeight, uint16_t maxValue, float32_t value, uint16_t foreground, uint16_t background) {
	uint16_t height;
	height = (uint16_t)((float32_t)value / (float32_t)maxValue * (float32_t)maxHeight);
	if (height == maxHeight) {
		TM_ILI9341_DrawLine(bottomX, bottomY, bottomX, bottomY - height, foreground);
	} else if (height < maxHeight) {
		TM_ILI9341_DrawLine(bottomX, bottomY, bottomX, bottomY - height, foreground);
		TM_ILI9341_DrawLine(bottomX, bottomY - height, bottomX, bottomY - maxHeight, background);
	}
}

void FlashLeds(float32_t freq) {


	if (freq >= 1100) {
		TM_DISCO_LedOff(LED_RED);
		TM_DISCO_LedOn(LED_GREEN);


		TIM_Cmd(TIM2, ENABLE);


	}

	if (freq < 900 /*&& freq > 10*/) {
		TM_DISCO_LedOn(LED_RED);
		TM_DISCO_LedOff(LED_GREEN);
		TM_ILI9341_Puts(10, 25, "                       ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
		TIM_Cmd(TIM2, DISABLE);
	}


}

void countSeconds() {
	if (secondsCount > 5) {
		TM_ILI9341_Puts(10, 25, "You Whistled for 5 sec!", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
		secondsCount = 0;
	}
}

void InitGPIO(void){
	/*Initializing Pin for additional LEDs s*/
	GPIO_InitTypeDef PORT;
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOC, ENABLE);
	
	PORT.GPIO_Pin = (GPIO_Pin_9 | GPIO_Pin_8);
	PORT.GPIO_Mode = GPIO_Mode_OUT;
	PORT.GPIO_Speed = GPIO_Low_Speed;
	
	GPIO_Init(GPIOC, &PORT);
	/********************/

