skandinaff/QREC/PROJECT-01-STM32F429_FFT/User/main.c
}

void INTTIM2_Config(void){

	
  NVIC_InitTypeDef NVIC_InitStructure;
  /* Enable the TIM2 gloabal Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* TIM2 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
  /* Time base configuration */
  TIM_TimeBaseStructure.TIM_Period = 100000 - 1;  // 1 MHz down to 1 KHz (1 ms)
  TIM_TimeBaseStructure.TIM_Prescaler = 450 - 1; // 24 MHz Clock down to 1 MHz (adjust per your clock)
  TIM_TimeBaseStructure.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM2, &TIM_TimeBaseStructure);
  /* TIM IT enable */
  TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);
  /* TIM2 enable counter */
  //TIM_Cmd(TIM2, ENABLE);
}

void TIM2_IRQHandler(void) {

	if (TIM_GetITStatus(TIM2, TIM_IT_Update) != RESET) {
		secondsCount += 1;
		TIM_ClearITPendingBit(TIM2, TIM_IT_Update);
		GPIO_ToggleBits(GPIOC, GPIO_Pin_9);
		//TM_ILI9341_Puts(10, 25, "You Whistled for 10 sec!", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	}
}

void INTTIM5_Config(void){

	
  NVIC_InitTypeDef NVIC_InitStructure_TIM5;
  /* Enable the TIM3 gloabal Interrupt */
  NVIC_InitStructure_TIM5.NVIC_IRQChannel = TIM5_IRQn;
  NVIC_InitStructure_TIM5.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_InitStructure_TIM5.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure_TIM5.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure_TIM5);

  /* TIM3 clock enable */
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM5, ENABLE);
  /* Time base configuration */
  TIM_TimeBaseStructure_TIM5.TIM_Period = 100 - 1;  // 1 MHz down to 1 KHz (1 ms)
  TIM_TimeBaseStructure_TIM5.TIM_Prescaler = 900 - 1; // 24 MHz Clock down to 1 MHz (adjust per your clock)
  TIM_TimeBaseStructure_TIM5.TIM_ClockDivision = 0;
  TIM_TimeBaseStructure_TIM5.TIM_CounterMode = TIM_CounterMode_Up;
  TIM_TimeBaseInit(TIM5, &TIM_TimeBaseStructure_TIM5);
  /* TIM IT enable */
  TIM_ITConfig(TIM5, TIM_IT_Update, ENABLE);
  /* TIM3 enable counter */
  TIM_Cmd(TIM5, ENABLE);
}

void TIM5_IRQHandler(void) {


	if (TIM_GetITStatus(TIM5, TIM_IT_Update) != RESET) {
		TIM_ClearITPendingBit(TIM5, TIM_IT_Update);

		sampleCounter += 1;


		counter += 1;          // This horrible thing here helps to get ~0.250ms refresh rate for drawing signal
		counter2 += 1;
		if (counter == 50) {
			tim5_count += 1;
			counter = 0;
		}
		if (counter2 == 150) {
			tim5_count2 += 1;
			counter2 = 0;
		}

	}
}

void readPulse2(void){

	

	TM_ILI9341_DrawPixel(tim5_count, 240-thresh/17, ILI9341_COLOR_RED);		


	

  Signal = TM_ADC_Read(ADC3, ADC_Channel_6);              // read the Pulse Sensor 
  //sampleCounter += 2; // 2 (ms)                         // keep track of the time in mS with this variable
																													// We've assigned this variable incrementation to a timer iinterrupts
  uint16_t N = sampleCounter - lastBeatTime;       // monitor the time since the last beat to avoid noise

    //  find the peak and trough of the pulse wave
  if(Signal < thresh && N > (IBI/5)*3){       // avoid dichrotic noise by waiting 3/5 of last IBI
    if (Signal < T){                        // T is the trough
      T = Signal;                         // keep track of lowest point in pulse wave 
    }
  }

  if(Signal > thresh && Signal > P){          // thresh condition helps avoid noise
    P = Signal;                             // P is the peak
  }                                        // keep track of highest point in pulse wave

  //  NOW IT'S TIME TO LOOK FOR THE HEART BEAT
  // signal surges up in value every time there is a pulse
  if (N > 250){                                   // avoid high frequency noise
		
		//Here I should add a condition that will check signal's amplitude, to avoiud measuremets that are just above 0
		
    if ( (Signal > thresh) && (Pulse == 0) && (N > (IBI/5)*3) && ((Signal - thresh) > 100) && (Signal - thresh) < 400 ){        
      Pulse = 1;                               // set the Pulse flag when we think there is a pulse
      GPIO_SetBits(GPIOC, GPIO_Pin_9);               // turn on pin 13 LED
			//TM_DISCO_LedOn(LED_GREEN);
      IBI = sampleCounter - lastBeatTime;         // measure time between beats in mS
      lastBeatTime = sampleCounter;               // keep track of time for next pulse

      if(secondBeat == 1){                        // if this is the second beat, if secondBeat == TRUE
        secondBeat = 0;                  // clear secondBeat flag
        for(uint16_t i=0; i<=9; i++){             // seed the running total to get a realisitic BPM at startup
          rate[i] = IBI;                      
        }
      }

      if(firstBeat == 1){                         // if it's the first time we found a beat, if firstBeat == TRUE
        firstBeat = 0;                   // clear firstBeat flag
        secondBeat = 1;                   // set the second beat flag

        return;                              // IBI value is unreliable so discard it
      }   


																								// keep a running total of the last 10 IBI values
      uint32_t runningTotal = 0;                  // clear the runningTotal variable    

      for(uint16_t i=0; i<=8; i++){                // shift data in the rate array
        rate[i] = rate[i+1];                  // and drop the oldest IBI value 
        runningTotal += rate[i];              // add up the 9 oldest IBI values
      }

      rate[9] = IBI;                          // add the latest IBI to the rate array
      runningTotal += rate[9];                // add the latest IBI to runningTotal
      runningTotal /= 10;                     // average the last 10 IBI values 
      BPM = 60000/runningTotal;               // how many beats can fit into a minute? that's BPM!
      QS = 1;                              // set Quantified Self flag 
      // QS FLAG IS NOT CLEARED INSIDE THIS ISR
    }                       
  }

  if (Signal < thresh && Pulse == 1){   // when the values are going down, the beat is over
    GPIO_ResetBits(GPIOC, GPIO_Pin_9);              // turn off pin 13 LED
    //TM_DISCO_LedOff(LED_GREEN);
		Pulse = 0;                         // reset the Pulse flag so we can do it again

    amp = P - T;                           // get amplitude of the pulse wave
    thresh = amp/2 + T;                    // set thresh at 50% of the amplitude
    P = thresh;                            // reset these for next time
    T = thresh;
  }

  if (N > 1000){                           // if N milliseconds go by without a beat
    thresh = 2058;                          // set thresh default
    P = 2048;                               // set P default
    T = 2048;                               // set T default
    lastBeatTime = sampleCounter;          // bring the lastBeatTime up to date        
    firstBeat = 1;                      // set these to avoid noise
    secondBeat = 0;                    // when we get the heartbeat back
		
		//BPM = 0;		// Add this line here, so when no beat detected display shows 0
  }
	

	

///////////
	

	sprintf(adc_result_str, "%4d: ", Signal);
	TM_ILI9341_Puts(1, 5, "RAW ADC: ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	if(tim5_count2 != old_tim5_count) TM_ILI9341_Puts(125, 5, adc_result_str, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	
	sprintf(thresh_restult_str, "%4d: ",thresh);
	TM_ILI9341_Puts(1, 25, "Thresh: ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
  TM_ILI9341_Puts(125, 25, thresh_restult_str, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	
	sprintf(BPM_result_str, "%4d: ", BPM);
	TM_ILI9341_Puts(1, 45, "BPM: ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	if(Pulse == 1){
		TM_ILI9341_Puts(125, 45, BPM_result_str, &TM_Font_11x18, ILI9341_COLOR_RED, ILI9341_COLOR_WHITE);
		//TM_USART_Putc(USART1, BPM);
	}
	

	
