skandinaff/QREC/PROJECT-01-STM32F429_FFT/User/main.c
	old_tim5_count = tim5_count2;

	if(tim5_count >= 320){
		tim5_count = 1;
		TM_ILI9341_Fill(ILI9341_COLOR_WHITE);
	
	}
	


		TM_ILI9341_DrawPixel(tim5_count, 240-Signal/17, 0x1234);		
	
	 if(BPM > 120) {
		TIM_Cmd(TIM2, ENABLE);
		if(secondsCount >= 5){
			TM_ILI9341_Puts(1, 65, "You have >120 BPM for >5 sec", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
			
		}
	 }else{
		TIM_Cmd(TIM2, DISABLE);
		 TM_ILI9341_Puts(1, 65, "                              ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
		 secondsCount=0;
	 }
	
	
}

void DetectWhistle(arm_cfft_radix4_instance_f32 S, float32_t maxValue, uint32_t maxIndex, uint16_t i){
	
	
		TM_ILI9341_Puts(150, 10,"           ", &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	//arm_cfft_radix4_instance_f32 S;	/* ARM CFFT module */
	//float32_t maxValue;							/* Max FFT value is stored here */
	//uint32_t maxIndex;							/* Index in Output array where max value is */
	//uint16_t i;
		
		/* This part should be done with DMA and timer for ADC treshold */
		/* Actually, best solution is double buffered DMA with timer for ADC treshold */
		/* But this is only for show principle on how FFT works */
		for (i = 0; i < SAMPLES; i += 2) {
			/* Each 22us ~ 45kHz sample rate */
			Delay(21);
			
			/* We assume that sampling and other stuff will take about 1us */
			
			/* Real part, must be between -1 and 1 */
			Input[(uint16_t)i] = (float32_t)((float32_t)TM_ADC_Read(ADC1, ADC_Channel_3) - (float32_t)2048.0) / (float32_t)2048.0;
			/* Imaginary part */
			Input[(uint16_t)(i + 1)] = 0;
		}
		
		/* Initialize the CFFT/CIFFT module, intFlag = 0, doBitReverse = 1 */
		arm_cfft_radix4_init_f32(&S, FFT_SIZE, 0, 1);
		
		/* Process the data through the CFFT/CIFFT module */
		arm_cfft_radix4_f32(&S, Input);
		
		/* Process the data through the Complex Magniture Module for calculating the magnitude at each bin */
		arm_cmplx_mag_f32(Input, Output, FFT_SIZE);
		
		/* Calculates maxValue and returns corresponding value */
		arm_max_f32(Output, FFT_SIZE, &maxValue, &maxIndex);
	
		/* This is me trying to output frequency as a number */
		TM_ILI9341_Puts(10, 10, "Peak Freq:",&TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
			
		
		char str[64];
		float32_t freq;
			
		freq = maxIndex * (45000 / 256);  // If a condition is added here, that cut's off low frequencies, just reaching 
																											// certain frequency is enough to trigger the event
			
		sprintf(str, "%.0f Hz", freq);
		
		if(maxIndex > 0) TM_ILI9341_Puts(150, 10, str, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
				
		FlashLeds( freq );
		countSeconds();
	
		/* Display data on LCD */
		for (i = 0; i < FFT_SIZE / 2; i++) {
			/* Draw FFT results */
			DrawBar(30 + 2 * i,
					220,
					FFT_BAR_MAX_HEIGHT,
					(uint16_t)maxValue,
					(float32_t)Output[(uint16_t)i],
					0x1234,
					0xFFFF
			);
		}

}

void BUTTON1_EventHandler(TM_BUTTON_PressType_t type) {
	/* Check button */
	if (type == TM_BUTTON_PressType_OnPressed) {
		
			ButtonState++;
		  TM_ILI9341_Fill(ILI9341_COLOR_WHITE);
			tim5_count=1;
		
	} else if (type == TM_BUTTON_PressType_Normal) {

	} else {

	}
}

void InitUSART(void){
	
	GPIO_InitTypeDef GPIO_InitStruct;
	USART_InitTypeDef USART_InitStruct;
	NVIC_InitTypeDef NVIC_InitStruct;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);
 

	GPIO_PinAFConfig(GPIOA, GPIO_PinSource9, GPIO_AF_USART1);
	GPIO_PinAFConfig(GPIOA, GPIO_PinSource10, GPIO_AF_USART1);
	
	// Initialize pins as alternating function
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9 | GPIO_Pin_10;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_UP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	//Enable clock for usart1


	

	/**
	 * Enable clock for USART1 peripheral
	 */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);


	USART_InitStruct.USART_BaudRate = 9600;
	USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStruct.USART_Parity = USART_Parity_No;
	USART_InitStruct.USART_StopBits = USART_StopBits_1;
	USART_InitStruct.USART_WordLength = USART_WordLength_8b;
	USART_Init(USART1, &USART_InitStruct);
	
	USART_Cmd(USART1, ENABLE);

	/**
	 * Enable RX interrupt
	 */
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

	/**
	 * Set Channel to USART1
	 * Set Channel Cmd to enable. That will enable USART1 channel in NVIC
	 * Set Both priorities to 0. This means high priority
	 *
	 * Initialize NVIC
	 */
	NVIC_InitStruct.NVIC_IRQChannel = USART1_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);
		
}

void SendData(unsigned char tx_data[DATA_PACKET_LEN]) {
    // Older implementation
    unsigned char i;

    for (i = 0; i < DATA_PACKET_LEN; i++) {
        while (USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET);
        USART_SendData(USART1, tx_data[i]);
        //memset(&rx_data[0], 0, sizeof(rx_data)); // Clear the buffer once data sent out

    }

}


void DisplayDataOnLcd(char* input){
	char output[14];
	sprintf(output, "%02X%02X%02X%02X%02X%02X%02X", input[0], input[1], input[2], input[3], input[4], input[5], input[6]);

	TM_ILI9341_Puts(1, 20, output, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);

	/*
	int len = strlen(input);


	char* output = malloc(len * 2 * sizeof(char));

	char tmp[2]; // 1 char contains 2 HEX encoded "characters"
	int output_index = 0;
	for (int i = 0; i < len; i++) {
		sprintf(tmp, "%X", input[i]); // convert 1 char to 2 HEX encoded "characters"

		output[2*output_index] = tmp[0];
		output[2*output_index+1] = tmp[1];

		output_index++;
	}

	TM_ILI9341_Puts(1, 20, output, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);
	*/
}


void USART1_IRQHandler(void) {


    if (USART_GetITStatus(USART1, USART_IT_RXNE) == SET) {
        if ((USART1->SR & (USART_FLAG_NE | USART_FLAG_FE | USART_FLAG_PE | USART_FLAG_ORE)) == 0) {
            rx_buffer[rx_wr_index++] = (uint8_t)(USART_ReceiveData(USART1) & 0xFF);
            if (rx_wr_index == RX_BUFFER_SIZE) rx_wr_index = 0;
            if (++rx_counter == RX_BUFFER_SIZE) {
                rx_counter = 0;
                rx_buffer_overflow = 1;
            }
        }
        else USART_ReceiveData(USART1);//вообще здесь нужен обработчик ошибок, а мы просто пропускаем битый байт
    }

    if (USART_GetITStatus(USART1, USART_IT_ORE_RX) == SET) //прерывание по переполнению буфера
    {
        USART_ReceiveData(
                USART1); //в идеале пишем здесь обработчик переполнения буфера, но мы просто сбрасываем этот флаг прерывания чтением из регистра данных.
    }

    if (USART_GetITStatus(USART1, USART_IT_TXE) == SET) {
        if (tx_counter) {
            --tx_counter;
            USART_SendData(USART1, tx_buffer[tx_rd_index++]);
            if (tx_rd_index == TX_BUFFER_SIZE) tx_rd_index = 0;
        }
        else {
            USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
        }
    }


