skandinaff/QREC/PROJECT-01-STM32F429_FFT/User/main.c
}


unsigned char get_char(void) { // Data recive 
    uint8_t data;
    data = rx_buffer[rx_rd_index++]; //Getting data from the buffer
    if (rx_rd_index == RX_BUFFER_SIZE) rx_rd_index = 0; //cycling through buffer
    USART_ITConfig(USART1, USART_IT_RXNE, DISABLE); // disabling interrupt
    --rx_counter;                                                                        // so it won't interfere change variable
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);  // enebling it back again
    return data;
}		


bool usart_has_data() {
	return rx_counter != 0;
}


void usart_get_data_packet(char* packet) {	
	if (!usart_has_data()) {
		*packet = '\0';
		return;
	}
	
	uint8_t packet_byte;	
	do {
		while (rx_counter == 0); // Wait if there's no data 
		
		packet_byte = get_char();
		
		*packet++ = packet_byte;
	} while (packet_byte != STOP_BYTE);

	*packet = '\0';
}


void put_char(uint8_t c) {
    if (c) {
        while (tx_counter == TX_BUFFER_SIZE);
        USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
        if (tx_counter || (USART_GetFlagStatus(USART1, USART_FLAG_TXE) == RESET)) {
            tx_buffer[tx_wr_index++] = c;
            if (tx_wr_index == TX_BUFFER_SIZE) tx_wr_index = 0;
            ++tx_counter;
            USART_ITConfig(USART1, USART_IT_TXE, ENABLE);
        }
        else
            USART_SendData(USART1, c);
    }
}


void put_str(unsigned char *s) {
    while (*s != 0)
        put_char(*s++);
}


bool usart_packet_is_addressed_to_me(incoming_packet_t incoming_packet) {
    return incoming_packet.slave_address == QUEST_ID;
}


incoming_packet_t usart_packet_parser(char* packet) {
    incoming_packet_t incoming_packet;
    incoming_packet.packet_length = strlen(packet);

    incoming_packet.master_stat_byte = packet[0];
    incoming_packet.slave_address = packet[1];
    incoming_packet.instruction = packet[2];

    if (incoming_packet.packet_length == 7) {
        incoming_packet.player_count = packet[3];
        incoming_packet.hint_count = packet[4];
    }

    incoming_packet.stop_byte = packet[incoming_packet.packet_length == 7 ? 6 : 4];
    incoming_packet.crc8 = packet[incoming_packet.packet_length == 7 ? 5 : 3];

    return incoming_packet;
}


void usart_peform_instruction(incoming_packet_t incoming_packet) {
    switch (incoming_packet.instruction) {
        case INSTR_MASTER_TEST:
            // TODO: gotov ili ne gotov k rabote
            put_str("A");
            break;
        case INSTR_MASTER_WORK_START:
            // TODO: nachinaem quest
            put_str("B");
            break;
        case INSTR_MASTER_STATUS_REQ:
            put_str("C");
            // TODO: zapros viponen kvest ili net
            break;
        case INSTR_MASTER_SET_IDLE:
            put_str("D");
            // TODO: vernutj v ishodnoe sostojanie
            break;
    }
}


outgoing_packet_t usart_assemble_response(char instruction) {
    outgoing_packet_t outgoing_packet;
    outgoing_packet.slave_start_byte = SLAVE_START_BYTE;
    outgoing_packet.slave_address = QUEST_ID;
    outgoing_packet.instruction = instruction;
    outgoing_packet.crc8 = RESTRICTED_BYTE; // TODO: CHANGE ME PLZ!!!
    outgoing_packet.stop_byte = STOP_BYTE;

    if (outgoing_packet.crc8 == STOP_BYTE ||
            outgoing_packet.crc8 == MASTER_START_BYTE ||
            outgoing_packet.crc8 == SLAVE_START_BYTE ||
            outgoing_packet.crc8 == RESTRICTED_BYTE) {
        outgoing_packet.crc8 ^= RESTRICTED_BYTE;
    }

    return outgoing_packet;
}

void usart_convert_outgoing_packet (char* packet, outgoing_packet_t outgoing_packet) {
    packet[0] = outgoing_packet.slave_start_byte;
    packet[1] = outgoing_packet.slave_address;
    packet[2] = outgoing_packet.instruction;
    packet[3] = outgoing_packet.crc8;
    packet[4] = outgoing_packet.stop_byte;
    packet[5] = '\0';
}


int main(void) {
	arm_cfft_radix4_instance_f32 S;	/* ARM CFFT module */
	float32_t maxValue;							/* Max FFT value is stored here */
	uint32_t maxIndex;							/* Index in Output array where max value is */
	uint16_t i;

	/* Initialize system */
	SystemInit();
	
	/* Delay init */
	TM_DELAY_Init();
	
	/* Initialize LED's on board */
	TM_DISCO_LedInit();
		
	TM_BUTTON_Init(GPIOA, GPIO_PIN_0, 1, BUTTON1_EventHandler);

	InitGPIO();
	INTTIM2_Config();
	INTTIM5_Config();

	
	/* Initialize LCD */
	TM_ILI9341_Init();
	TM_ILI9341_Rotate(TM_ILI9341_Orientation_Landscape_1);


	/* Initialize ADC, PA0 is used */
	TM_ADC_Init(ADC1, ADC_Channel_3); // PA3 Microphone's ADC 
	
	TM_ADC_Init(ADC3, ADC_Channel_6); // PF8 PulseSensor's ADC
	

	InitUSART();
	
	Delayms(300);
	
	unsigned char a[] = {0x00, 0x11, 0x22, 0x33, 0x44, 0x55, 0x66}; // Start Up Sequence 
	
  SendData(a);

	
	char* packet = malloc((DATA_PACKET_LEN + 1) * sizeof(char));
	incoming_packet_t incoming_packet;
	while (1) {	
		TM_BUTTON_Update();
			
		switch (ButtonState) {
			case 0:
				DetectWhistle(S, maxValue, maxIndex, i);	
				break;
			case 1:
				TM_DISCO_LedOff(LED_RED);
				TM_DISCO_LedOff(LED_GREEN);				
				readPulse2();
				break;
			case 2:
				DisplayDataOnLcd(packet);
				break;
			case 3:
				// put_str(packet);
			
				ButtonState++;			
				break;
			default:
				ButtonState = 0;
				break;
		}

		
		if (usart_has_data()) {
			usart_get_data_packet(packet);
            incoming_packet = usart_packet_parser(packet);
            if (usart_packet_is_addressed_to_me(incoming_packet)) {
                usart_peform_instruction(incoming_packet);

                // TODO: THIS BIT SENDS THE OUTGOING PACKET
                char instruction = INSTR_SLAVE_NOT_READY;
                instruction = INSTR_SLAVE_READY;
                instruction = INSTR_SLAVE_NOT_COMLETED;
                instruction = INSTR_SLAVE_READY;

                char* packet = malloc((OUTGOING_PACKET_LENGTH + 1) * sizeof(char));
                outgoing_packet_t outgoing_packet = usart_assemble_response(instruction);
                usart_convert_outgoing_packet(packet, outgoing_packet);
                put_str("www");
                put_str(packet);
            }
		}

		
		char state[1];
		sprintf(state, "%d", ButtonState);
		TM_ILI9341_Puts(280, 10, state, &TM_Font_11x18, ILI9341_COLOR_BLACK, ILI9341_COLOR_WHITE);	

		
		/*** This is for pulse readings ***/
		if(QS == 1) QS = !QS; 						// A Heartbeat Was Found, reset the Quantified Self flag for next time    
		/**********************************/	
	}
	
	// free(packet);
}
